# Задание 4 из ЕГЭ-2025 профиль [https://math-ege.sdamgia.ru/test?id=86355907]
# В случайном эксперименте симметричную монету бросают дважды. Найдите вероятность того, что орел выпадет ровно один раз.
# Все исходы: ОО, ОР, РО, РР
# Благоприятные: ОР, РО (ровно один орёл)

благоприятные = 2
всего_исходов = 4

вероятность = благоприятные / всего_исходов

print(вероятность)
